In [1]:
import sys
print('python', sys.version)

import numpy as np
print('numpy', np.__version__)

import pandas as pd
print('pandas', pd.__version__)

# 결과 확인을 용이하게 하기 위한 코드
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = 'all'

python 3.9.7 (default, Sep 16 2021, 16:59:28) [MSC v.1916 64 bit (AMD64)]
numpy 1.20.3
pandas 1.3.4

In [2]:
s1=pd.Series(data=[1,2,3,4,5],index=list('abcde'))
s2=pd.Series(data=[5,2,4,3,1],index=list('abcde'))
s1*s2
s1>s2

a     5
b     4
c    12
d    12
e     5
dtype: int64

a    False
b    False
c    False
d     True
e     True
dtype: bool

In [5]:
s1=pd.Series(data=[1,2,3,4,5],index=list('abcde'))
s2=pd.Series(data=[5,2,4,3,1],index=list('daecb'))
s1*s2
s1>s2 # index가 완전히 동일해야 가능

a     2
b     2
c     9
d    20
e    20
dtype: int64

ValueError: Can only compare identically-labeled Series objects

In [8]:
s1=pd.Series(data=[3,2,1,4,5],index=list('cdbef'),name='s1')
s1
s2=pd.Series(data=[3,2,1,4,5],index=list('abcde'),name='s2')
s2
s3=s1+s2
s3
s3.isnull()
s3.notnull()
s3[s3.notnull()]
s1>s2 # 에러발생

c    3
d    2
b    1
e    4
f    5
Name: s1, dtype: int64

a    3
b    2
c    1
d    4
e    5
Name: s2, dtype: int64

a    NaN
b    3.0
c    4.0
d    6.0
e    9.0
f    NaN
dtype: float64

a     True
b    False
c    False
d    False
e    False
f     True
dtype: bool

a    False
b     True
c     True
d     True
e     True
f    False
dtype: bool

b    3.0
c    4.0
d    6.0
e    9.0
dtype: float64

ValueError: Can only compare identically-labeled Series objects

In [9]:
s1=pd.Series(data=[1,2,3,4,5],index=list('abcde'),name='s1')
s1
np.exp(s1)
np.power(s1,2)

a    1
b    2
c    3
d    4
e    5
Name: s1, dtype: int64

a      2.718282
b      7.389056
c     20.085537
d     54.598150
e    148.413159
Name: s1, dtype: float64

a     1
b     4
c     9
d    16
e    25
Name: s1, dtype: int64

### 실습1

In [24]:
sr1=pd.Series(np.random.randint(10,size=10),np.arange(0,10))
sr1
sr2=sr1*3+1
sr2.name='sr2'
sr2
sr3=sr2.loc[sr2%5==0]
sr3
np.sum(sr3.index)

0    9
1    5
2    1
3    8
4    4
5    0
6    2
7    3
8    4
9    5
dtype: int32

0    28
1    16
2     4
3    25
4    13
5     1
6     7
7    10
8    13
9    16
Name: sr2, dtype: int32

3    25
7    10
Name: sr2, dtype: int32

10

### 실습2

In [31]:
sr1=pd.Series(np.random.randint(100,size=6),index=list('abcdef'))
sr1
sr1=sr1.sort_values(ascending=False)
sr1
sr1.index[1]

a    34
b    72
c    47
d    37
e    21
f    19
dtype: int32

b    72
c    47
d    37
a    34
e    21
f    19
dtype: int32

'c'

### 실습3

In [37]:
sr1=pd.Series(np.random.randint(10,size=5),index=np.random.choice(list('abcdefgh'),size=5,replace=False))
sr2=pd.Series(np.random.randint(10,size=5),index=np.random.choice(list('abcdefgh'),size=5,replace=False))
sr3=pd.Series(np.random.randint(10,size=5),index=np.random.choice(list('abcdefgh'),size=5,replace=False))
s1
s2
s3
s4=s1+s2+s3
s4
s5=s4[s4.notnull()]
s5
s5.sum()

a    1
b    2
c    3
d    4
e    5
Name: s1, dtype: int64

a    3
b    2
c    1
d    4
e    5
Name: s2, dtype: int64

a    NaN
b    3.0
c    4.0
d    6.0
e    9.0
f    NaN
dtype: float64

a     NaN
b     7.0
c     8.0
d    14.0
e    19.0
f     NaN
dtype: float64

b     7.0
c     8.0
d    14.0
e    19.0
dtype: float64

48.0

In [43]:
dat=np.arange(12).reshape(3,4)
dat
d1=pd.DataFrame(data=dat,index=[1,2,3],columns=list('abcd'),dtype=float)
d1
d2=d1['c']
d2

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

     a    b     c     d
1  0.0  1.0   2.0   3.0
2  4.0  5.0   6.0   7.0
3  8.0  9.0  10.0  11.0

1     2.0
2     6.0
3    10.0
Name: c, dtype: float64

In [3]:
dict={'a':[1,2,3],'b':[2,3,4],'c':[3,4,5]}
d1=pd.DataFrame(dict)
d1
d2=pd.DataFrame(dict,index=['g','e','t'])
d2

   a  b  c
0  1  2  3
1  2  3  4
2  3  4  5

   a  b  c
g  1  2  3
e  2  3  4
t  3  4  5

In [4]:
dict={'a':{'d':1,'e':2},'b':{'d':10,'e':20},'c':{'d':100,'e':200}}
df1=pd.DataFrame(dict)
df1

   a   b    c
d  1  10  100
e  2  20  200

In [12]:
d1=pd.read_table('pandas_data1-Copy1.txt',index_col=0,sep='\t',encoding='cp949')
d1.head()
d1.tail()
d1.dtypes

     성별  학년  중간  기말  출석  과제
이름
김둘   여자   1  17  36   5  75
김셋   남자   2  17  20   5  96
김여섯  남자   2  28  20   4  83
김일곱  남자   2  20  44   6  82
김여덜  남자   1  20  24   8  88

     성별  학년  중간  기말  출석  과제
이름
김다섯  남자   2  24  18   6  84
이하나  남자   3  29  17   5  79
이둘   남자   4  30  42   8  98
이셋   남자   4  22  50   4  79
이넷   여자   4  24  21  10  89

성별    object
학년     int64
중간     int64
기말     int64
출석     int64
과제     int64
dtype: object

In [13]:
d1=pd.read_table('pandas_data1-Copy1.txt',header=None,sep='\t',encoding='cp949')
d1.head()
d1=pd.read_table('pandas_data1-Copy1.txt',sep='\t',encoding='cp949')
d1.head()
d1=pd.read_table('pandas_data1-Copy1.txt',index_col='이름',sep='\t',encoding='cp949')
d1.head()
d1=pd.read_table('pandas_data1-Copy1.txt',index_col='이름',usecols=['이름','출석','과제'],sep='\t',encoding='cp949')
d1.head()

     0   1   2   3   4   5   6
0   이름  성별  학년  중간  기말  출석  과제
1   김둘  여자   1  17  36   5  75
2   김셋  남자   2  17  20   5  96
3  김여섯  남자   2  28  20   4  83
4  김일곱  남자   2  20  44   6  82

    이름  성별  학년  중간  기말  출석  과제
0   김둘  여자   1  17  36   5  75
1   김셋  남자   2  17  20   5  96
2  김여섯  남자   2  28  20   4  83
3  김일곱  남자   2  20  44   6  82
4  김여덜  남자   1  20  24   8  88

     성별  학년  중간  기말  출석  과제
이름
김둘   여자   1  17  36   5  75
김셋   남자   2  17  20   5  96
김여섯  남자   2  28  20   4  83
김일곱  남자   2  20  44   6  82
김여덜  남자   1  20  24   8  88

     출석  과제
이름
김둘    5  75
김셋    5  96
김여섯   4  83
김일곱   6  82
김여덜   8  88

In [15]:
d0=pd.read_table('pandas_data2-Copy1.txt',sep='\t',encoding='cp949')
d0
d1=pd.read_table('pandas_data2-Copy1.txt',index_col=2,sep='\t',encoding='cp949')
d1
d2=pd.read_table('pandas_data2-Copy1.txt',index_col='2',sep='\t',encoding='cp949')
d2

  num   4   1   3   2   5
0   a  99  98  24   9  73
1   b  36   6  21  79  82
2   c  44  49  39  54  13
3   d  53  94  44  81  35

   num   4   3   2   5
1
98   a  99  24   9  73
6    b  36  21  79  82
49   c  44  39  54  13
94   d  53  44  81  35

   num   4   1   3   5
2
9    a  99  98  24  73
79   b  36   6  21  82
54   c  44  49  39  13
81   d  53  94  44  35

In [3]:
d1=pd.read_table('pandas_data1-Copy1.txt',sep='\t',encoding='cp949')
d1.head()

    이름  성별  학년  중간  기말   출석  과제
0   김둘  여자   1  17  36  5.0  75
1   김셋  남자   2  17  20  5.0  96
2  김여섯  남자   2  28  20  4.0  83
3  김일곱  남자   2  20  44  NaN  82
4  김여덜  남자   1  20  24  8.0  88

### 실습4

In [16]:
dat=[['aa','suwon',2],['bb','suwon',1],['cc','aju',3]]
d1=pd.DataFrame(data=dat,index=['st1','st2','st3'],columns=['name','univ','rank'])
d1
dict={'name':['aa','bb','cc'],'univ':['suwon','suwon','ajr'],'rank':[2,1,3]}
d2=pd.DataFrame(data=dict,index=['st1','st2','st3'])
d2
d3=pd.read_table('pandas_data5.txt',index_col=0,sep='\t',encoding='cp949')
d3
d4=pd.read_table('pandas_data5.txt',sep='\t',encoding='cp949')
d4

    name   univ  rank
st1   aa  suwon     2
st2   bb  suwon     1
st3   cc    aju     3

    name   univ  rank
st1   aa  suwon     2
st2   bb  suwon     1
st3   cc    ajr     3

    name   univ  rank
st1   aa  suwon     2
st2   bb  suwon     1
st3   cc    ajr     3

  Unnamed: 0 name   univ  rank
0        st1   aa  suwon     2
1        st2   bb  suwon     1
2        st3   cc    ajr     3

In [25]:
dict={'a':[1,2,3],'b':[2,3,4],'c':[3,4,5]}
d1=pd.DataFrame(dict,index=['g','k','p'])
d1
d1.index
d1.index.name
d1.columns
d1.columns.name
d1.dtypes
d1.values
type(d1.values)

d1.index=['A','B','C']
d1.index.name='ids'
d1.columns=list('uoi')
d1=d1.astype(float)
d1['u']=d1['u'].astype(int)
d1['o']=[10,20,30]
d1['o']=d1['o'].astype(float)
d1

   a  b  c
g  1  2  3
k  2  3  4
p  3  4  5

Index(['g', 'k', 'p'], dtype='object')

Index(['a', 'b', 'c'], dtype='object')

a    int64
b    int64
c    int64
dtype: object

array([[1, 2, 3],
       [2, 3, 4],
       [3, 4, 5]], dtype=int64)

numpy.ndarray

     u     o    i
ids
A    1  10.0  3.0
B    2  20.0  4.0
C    3  30.0  5.0

In [27]:
dic1={'a':[1,2,3],'b':[2,3,4], 'c':[3,4,5]}
df1=pd.DataFrame(data=dic1, index=list('gkp'))
df1
df1.mean(axis=0)
df1['c']=df1['c'].astype(str)
df1
df1.mean(axis=0)

   a  b  c
g  1  2  3
k  2  3  4
p  3  4  5

a    2.0
b    3.0
c    4.0
dtype: float64

   a  b  c
g  1  2  3
k  2  3  4
p  3  4  5

a      2.0
b      3.0
c    115.0
dtype: float64

In [34]:
sr1=pd.Series(np.random.randint(100,size=5),np.random.randint(100,size=5))
sr1
d1=sr1[sr1%2==0]
d1
np.sum(d1.index)

73    81
34     2
85    56
33     4
31    37
dtype: int32

34     2
85    56
33     4
dtype: int32

152

In [40]:
d1=pd.read_table('pandas_data3-Copy1.txt',usecols=['이름','학년','중간'],index_col=0,sep='\t',encoding='cp949')
d1

      학년    중간
이름
김둘   1.0   NaN
김셋   2.0  17.0
김여섯  2.0  28.0
김일곱  NaN  20.0
김여덜  1.0  20.0
김아홉  3.0  23.0
김열   3.0  16.0
이다섯  3.0  21.0
이아홉  3.0  20.0
이열   4.0  28.0
박하나  4.0  30.0
박둘   4.0  20.0
박여섯  1.0  24.0
김하나  2.0  19.0
박열   3.0  23.0
최하나  1.0  29.0
최둘   1.0  18.0
최셋   2.0  29.0
이여섯  3.0  22.0
이일곱  3.0  24.0
이여덜  4.0  17.0
최여덜  4.0  13.0
최아홉  1.0  21.0
최열   2.0  16.0
김넷   1.0  18.0
김다섯  2.0  24.0
이하나  3.0  29.0
이둘   4.0  30.0
이셋   4.0  22.0
이넷   4.0  24.0

In [2]:
dat=[[1,2,3],[2,3,4],[3,4,5]]
d1=pd.DataFrame(data=dat,index=['g','k','p'],columns=['a','b','c'])
d1
d1.index=['aa','bb','cc']
d1.index.name='index'
d1.columns.name='column'
d1['b']=[11.1,22,33]
d1=d1.astype(float)
d1['a']=d1['a'].astype(int)
d1

   a  b  c
g  1  2  3
k  2  3  4
p  3  4  5

column  a     b    c
index
aa      1  11.1  3.0
bb      2  22.0  4.0
cc      3  33.0  5.0

## 연습

In [7]:
s1=pd.Series([1,2,3,4,5],index=list('abcde'))
s2=pd.Series([6,1,8,3,10],index=list('abcde'))
s1+s2
np.sum(s1>s2)

a     7
b     3
c    11
d     7
e    15
dtype: int64

2

In [13]:
s1=pd.Series([6,1,8,3,10],index=list('abcde'))
s2=pd.Series([6,1,8,3,10],index=list('cdbef'))
s3=s1+s2
s3
np.sum(s3.isnull())
s3.notnull()
s3[s3.isnull()]

a     NaN
b     9.0
c    14.0
d     4.0
e    13.0
f     NaN
dtype: float64

2

a    False
b     True
c     True
d     True
e     True
f    False
dtype: bool

a   NaN
f   NaN
dtype: float64

#### 실습1

In [18]:
sr1=pd.Series(np.random.randint(10,size=10),index=np.arange(10))
sr1
sr2=sr1*3+1
sr2
sr3=sr2[sr2%5==0]
sr3
np.sum(sr3.index)

0    7
1    3
2    6
3    6
4    2
5    4
6    2
7    3
8    3
9    5
dtype: int32

0    22
1    10
2    19
3    19
4     7
5    13
6     7
7    10
8    10
9    16
dtype: int32

1    10
7    10
8    10
dtype: int32

16

#### 실습2

In [28]:
sr1=pd.Series(np.random.randint(100,size=6),index=list('abcdef'))
sr1
sr1=sr1.sort_values(ascending=False)
sr1
sr1.index[1]

a    26
b    59
c    17
d    59
e    41
f    27
dtype: int32

b    59
d    59
e    41
f    27
a    26
c    17
dtype: int32

'd'

#### 실습3

In [38]:
sr1=pd.Series(np.random.randint(10,size=5),index=np.random.choice(list('abcdefgh'),size=5,replace=False))
sr2=pd.Series(np.random.randint(10,size=5),index=np.random.choice(list('abcdefgh'),size=5,replace=False))
sr3=pd.Series(np.random.randint(10,size=5),index=np.random.choice(list('abcdefgh'),size=5,replace=False))
sr4=sr1+sr2+sr3
sr4
sr4[sr4.notnull()].sum()

a     NaN
b     NaN
c     NaN
d     NaN
e     NaN
f     NaN
g     NaN
h    11.0
dtype: float64

11.0

## 연습

In [47]:
dat=np.arange(16).reshape(4,4)
d1=pd.DataFrame(data=dat,index=[1,2,3,4],columns=list('ABCD'))
d1
d1.dtypes

datt=[[1,2,3,4],['a',5,6,7]]
d2=pd.DataFrame(data=datt,index=[1,2],columns=list('ABCD'))
d2
d2.dtypes
d2['A']

    A   B   C   D
1   0   1   2   3
2   4   5   6   7
3   8   9  10  11
4  12  13  14  15

A    int32
B    int32
C    int32
D    int32
dtype: object

   A  B  C  D
1  1  2  3  4
2  a  5  6  7

A    object
B     int64
C     int64
D     int64
dtype: object

1    1
2    a
Name: A, dtype: object

In [60]:
dict={'a':[1,2,3],'b':[100,200,300],'c':[10,20,30]}
d1=pd.DataFrame(dict,index=list('ABC'))
d1=d1.astype(float)
d1.dtypes

a    float64
b    float64
c    float64
dtype: object

In [66]:
d1=pd.read_table('pandas_data1-Copy1.txt',sep='\t',index_col='이름',usecols=['이름','성별','과제'],encoding='cp949')
d1.head()
d1.tail()
d1.dtypes

     성별  과제
이름
김둘   여자  75
김셋   남자  96
김여섯  남자  83
김일곱  남자  82
김여덜  남자  88

     성별  과제
이름
김다섯  남자  84
이하나  남자  79
이둘   남자  98
이셋   남자  79
이넷   여자  89

성별    object
과제     int64
dtype: object

In [74]:
d1=pd.read_table('pandas_data2-Copy1.txt',sep='\t',index_col='5',encoding='cp949')
d1.head()
d1=pd.read_table('pandas_data2-Copy1.txt',sep='\t',index_col=2,encoding='cp949')
d1.head()

   num   4   1   3   2
5
73   a  99  98  24   9
82   b  36   6  21  79
13   c  44  49  39  54
35   d  53  94  44  81

   num   4   3   2   5
1
98   a  99  24   9  73
6    b  36  21  79  82
49   c  44  39  54  13
94   d  53  44  81  35

#### 실습4

In [88]:
dat=[['aa','suwon',2],['bb','suwon',1],['cc','aju',3]]
d1=pd.DataFrame(data=dat,index=['st1','st2','st3'],columns=['name','univ','rank'])
d1

dict={'name':['aa','bb','cc'],'univ':['suwon','suwon','aju'],'rank':[2,1,3]}
d1=pd.DataFrame(dict,index=['st1','st2','st3'])
d1

d1=pd.read_table('pandas_data5.txt',index_col=0,sep='\t',encoding='cp949')
d1
d1.index.name='Name'
d1.columns.name='Kinds'
d1.dtypes
d1.values
d1['rank']=[11.1,12,3]
d1['rank']=d1['rank'].astype(int)
d1

    name   univ  rank
st1   aa  suwon     2
st2   bb  suwon     1
st3   cc    aju     3

    name   univ  rank
st1   aa  suwon     2
st2   bb  suwon     1
st3   cc    aju     3

    name   univ  rank
st1   aa  suwon     2
st2   bb  suwon     1
st3   cc    ajr     3

Kinds
name    object
univ    object
rank     int64
dtype: object

array([['aa', 'suwon', 2],
       ['bb', 'suwon', 1],
       ['cc', 'ajr', 3]], dtype=object)

Kinds name   univ  rank
Name
st1     aa  suwon    11
st2     bb  suwon    12
st3     cc    ajr     3

## 과제1

In [92]:
sr1=pd.Series(np.random.randint(100,size=5),index=np.random.randint(100,size=5))
sr1
a1=sr1[sr1%2==0]
np.sum(a1.index)

86    22
27    13
30    12
35    59
26    88
dtype: int32

142

In [98]:
d1=pd.read_table('pandas_data3-Copy1.txt',index_col='이름',usecols=['이름','학년','중간'],sep='\t',encoding='cp949')
d1

      학년    중간
이름
김둘   1.0   NaN
김셋   2.0  17.0
김여섯  2.0  28.0
김일곱  NaN  20.0
김여덜  1.0  20.0
김아홉  3.0  23.0
김열   3.0  16.0
이다섯  3.0  21.0
이아홉  3.0  20.0
이열   4.0  28.0
박하나  4.0  30.0
박둘   4.0  20.0
박여섯  1.0  24.0
김하나  2.0  19.0
박열   3.0  23.0
최하나  1.0  29.0
최둘   1.0  18.0
최셋   2.0  29.0
이여섯  3.0  22.0
이일곱  3.0  24.0
이여덜  4.0  17.0
최여덜  4.0  13.0
최아홉  1.0  21.0
최열   2.0  16.0
김넷   1.0  18.0
김다섯  2.0  24.0
이하나  3.0  29.0
이둘   4.0  30.0
이셋   4.0  22.0
이넷   4.0  24.0